//-----------------------------------------------------------------------------
// wxD - IControlWithItems.d
// (C) 2005 bero <berobero@users.sourceforge.net>
// based on
// wx.NET - IControlWithItems.cs
//
/// The ControlWithItems Interface.
//
// Written by Alexander Olk (xenomorph2@onlinehome.de)
// (C) 2004 Alexander Olk
// Licensed under the wxWidgets license, see LICENSE.txt for details.
//
// $Ид: IControlWithItems.d,v 1.9 2006/11/17 15:20:59 afb Exp $
//-----------------------------------------------------------------------------

module wx.IControlWithItems;
public import wx.ClientData;

public interface IControlWithItems
{
    цел Append(ткст элт);

    цел Append(ткст элт, ClientData clientData);

    //-----------------------------------------------------------------------------

    проц AppendString(ткст элт);

    //-----------------------------------------------------------------------------

    проц Append(ткст[] strings);

    //-----------------------------------------------------------------------------

    цел Insert(ткст элт, цел поз);

    цел Insert(ткст элт, цел поз, ClientData clientData);

    //-----------------------------------------------------------------------------

    проц очисть();

    //-----------------------------------------------------------------------------

    проц Delete(цел n);

    //-----------------------------------------------------------------------------

    цел Счёт();

    //-----------------------------------------------------------------------------

    бул Empty();

    //-----------------------------------------------------------------------------

    ткст GetString(цел n);

    //-----------------------------------------------------------------------------

    ткст[] GetStrings();

    //-----------------------------------------------------------------------------

    проц УстString(цел n, ткст s);

    //-----------------------------------------------------------------------------

    цел FindString(ткст s);

    //-----------------------------------------------------------------------------

    проц Select(цел n);

    цел GetSelection();

    //-----------------------------------------------------------------------------

    ткст StringSelection();

    //-----------------------------------------------------------------------------

    проц УстClientObject(цел n, ClientData clientData);

    ClientData GetClientObject(цел n);

    //-----------------------------------------------------------------------------

    бул HasClientObjectData();

    //-----------------------------------------------------------------------------

    бул HasClientUntypedData();

    //-----------------------------------------------------------------------------

    бул НаследоватьЦвета();
}

